var DATAONE = {"15":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：6-11","1600":"中度降雪：6-11","2000":"轻度降雪：11-18","2400":"轻度降雪：11-18","2800":"轻度降雪：11-18","3200":"轻度降雪：11-18","4000":"极轻度降雪：18-22","无":"小雨夹雪：2-5/冻雾：11-17"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"重度降雪：无推荐的保持时间","1600":"中度降雪：6-11","2000":"中度降雪：6-11","2400":"中度降雪：6-11","2800":"中度降雪：6-11","3200":"轻度降雪：11-18","4000":"极轻度降雪：18-22","无":"小雨夹雪：2-5/冻雾：11-17"}},"-1":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：6-11","1200":"中度降雪：6-11","1600":"轻度降雪：11-18","2000":"轻度降雪：11-18","2400":"轻度降雪：11-18","2800":"极轻度降雪：18-22","3200":"极轻度降雪：18-22","4000":"极轻度降雪：18-22","无":"小雨夹雪：2-5/冻雾：11-17"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：6-11","1600":"中度降雪：6-11","2000":"中度降雪：6-11","2400":"中度降雪：6-11","2800":"轻度降雪：11-18","3200":"轻度降雪：11-18","4000":"极轻度降雪：18-22","无":"小雨夹雪：2-5/冻雾：11-17"}},"-4":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：5-8","1200":"中度降雪：5-8","1600":"轻度降雪：8-14","2000":"轻度降雪：8-14","2400":"轻度降雪：8-14","2800":"极轻度降雪：14-17","3200":"极轻度降雪：14-17","4000":"极轻度降雪：14-17","无":"小雨夹雪：2-5/冻雾：8-13"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：5-8","1600":"中度降雪：5-8","2000":"中度降雪：5-8","2400":"中度降雪：5-8","2800":"轻度降雪：8-14","3200":"轻度降雪：8-14","4000":"极轻度降雪：14-17","无":"小雨夹雪：2-5/冻雾：8-13"}},"-7":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：4-6","1200":"中度降雪：4-6","1600":"轻度降雪：6-11","2000":"轻度降雪：6-11","2400":"轻度降雪：6-11","2800":"极轻度降雪：11-13","3200":"极轻度降雪：11-13","4000":"极轻度降雪：11-13","无":"小雨夹雪：2-5/冻雾：6-10"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：4-6","1600":"中度降雪：4-6","2000":"中度降雪：4-6","2400":"中度降雪：4-6","2800":"轻度降雪：6-11","3200":"轻度降雪：6-11","4000":"极轻度降雪：11-13","无":"小雨夹雪：2-5/冻雾：6-10"}},"-11":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：2-4","1200":"中度降雪：2-4","1600":"轻度降雪：4-7","2000":"轻度降雪：4-7","2400":"轻度降雪：4-7","2800":"极轻度降雪：7-8","3200":"极轻度降雪：7-8","4000":"极轻度降雪：7-8","无":"小雨夹雪：无推荐的保持时间/冻雾：5-9"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：2-4","1600":"中度降雪：2-4","2000":"中度降雪：2-4","2400":"中度降雪：2-4","2800":"轻度降雪：4-7","3200":"轻度降雪：4-7","4000":"极轻度降雪：7-8","无":"小雨夹雪：无推荐的保持时间/冻雾：5-9"}}};
var DATAFORE = {"15":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:35-1:10","1600":"中度降雪：0:35-1:10","2000":"轻度降雪：1:10-2:20","2400":"轻度降雪：1:10-2:20","2800":"轻度降雪：1:10-2:20","3200":"轻度降雪：1:10-2:20","4000":"极轻度降雪：2:20-2:45","无":"小雨夹雪：0:25-0:40/冻雾：1:15-2:40"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"重度降雪：无推荐的保持时间","1600":"中度降雪：0:35-1:10","2000":"中度降雪：0:35-1:10","2400":"中度降雪：0:35-1:10","2800":"中度降雪：0:35-1:10","3200":"轻度降雪：1:10-2:20","4000":"极轻度降雪：2:20-2:45","无":"小雨夹雪：0:25-0:40/冻雾：1:15-2:40"}},"-1":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:35-1:10","1200":"中度降雪：0:35-1:10","1600":"轻度降雪：1:10-2:20","2000":"轻度降雪：1:10-2:20","2400":"轻度降雪：1:10-2:20","2800":"极轻度降雪：2:20-2:45","3200":"极轻度降雪：2:20-2:45","4000":"极轻度降雪：2:20-2:45","无":"小雨夹雪：0:25-0:40/冻雾：1:15-2:40"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:35-1:10","1600":"中度降雪：0:35-1:10","2000":"中度降雪：0:35-1:10","2400":"中度降雪：0:35-1:10","2800":"轻度降雪：1:10-2:20","3200":"轻度降雪：1:10-2:20","4000":"极轻度降雪：2:20-2:45","无":"小雨夹雪：0:25-0:40/冻雾：1:15-2:40"}},"-4":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:30-0:55","1200":"中度降雪：0:30-0:55","1600":"轻度降雪：0:55-1:50","2000":"轻度降雪：0:55-1:50","2400":"轻度降雪：0:55-1:50","2800":"极轻度降雪：1:50-2:20","3200":"极轻度降雪：1:50-2:20","4000":"极轻度降雪：1:50-2:20","无":"小雨夹雪：0:20-0:25/冻雾：0:20-1:35"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:30-0:55","1600":"中度降雪：0:30-0:55","2000":"中度降雪：0:30-0:55","2400":"中度降雪：0:30-0:55","2800":"轻度降雪：0:55-1:50","3200":"轻度降雪：0:55-1:50","4000":"极轻度降雪：1:50-2:20","无":"小雨夹雪：0:20-0:25/冻雾：0:20-1:35"}},"-9":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:25-0:45","1200":"中度降雪：0:25-0:45","1600":"轻度降雪：0:45-1:20","2000":"轻度降雪：0:45-1:20","2400":"轻度降雪：0:45-1:20","2800":"极轻度降雪：1:20-1:40","3200":"极轻度降雪：1:20-1:40","4000":"极轻度降雪：1:20-1:40","无":"小雨夹雪：0:20-0:25/冻雾：0:20-1:35"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:25-0:45","1600":"中度降雪：0:25-0:45","2000":"中度降雪：0:25-0:45","2400":"中度降雪：0:25-0:45","2800":"轻度降雪：0:45-1:20","3200":"轻度降雪：0:45-1:20","4000":"极轻度降雪：1:20-1:40","无":"小雨夹雪：0:20-0:25/冻雾：0:20-1:35"}},"-11":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:25-0:45","1200":"中度降雪：0:25-0:45","1600":"轻度降雪：0:45-1:20","2000":"轻度降雪：0:45-1:20","2400":"轻度降雪：0:45-1:20","2800":"极轻度降雪：1:20-1:40","3200":"极轻度降雪：1:20-1:40","4000":"极轻度降雪：1:20-1:40","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-1:35"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:25-0:45","1600":"中度降雪：0:25-0:45","2000":"中度降雪：0:25-0:45","2400":"中度降雪：0:25-0:45","2800":"轻度降雪：0:45-1:20","3200":"轻度降雪：0:45-1:20","4000":"极轻度降雪：1:20-1:40","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-1:35"}},"-15":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:02-0:09","1200":"中度降雪：0:02-0:09","1600":"轻度降雪：0:09-0:30","2000":"轻度降雪：0:09-0:30","2400":"轻度降雪：0:09-0:30","2800":"极轻度降雪：0:30-0:45","3200":"极轻度降雪：0:30-0:45","4000":"极轻度降雪：0:30-0:45","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:02-0:09","1600":"中度降雪：0:02-0:09","2000":"中度降雪：0:02-0:09","2400":"中度降雪：0:02-0:09","2800":"轻度降雪：0:09-0:30","3200":"轻度降雪：0:09-0:30","4000":"极轻度降雪：0:30-0:45","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"}},"-19":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:01-0:03","1200":"中度降雪：0:01-0:03","1600":"轻度降雪：0:03-0:10","2000":"轻度降雪：0:03-0:10","2400":"轻度降雪：0:03-0:10","2800":"极轻度降雪：0:10-0:20","3200":"极轻度降雪：0:10-0:20","4000":"极轻度降雪：0:10-0:20","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:01-0:03","1600":"中度降雪：0:01-0:03","2000":"中度降雪：0:01-0:03","2400":"中度降雪：0:01-0:03","2800":"轻度降雪：0:03-0:10","3200":"轻度降雪：0:03-0:10","4000":"极轻度降雪：0:10-0:20","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"}},"-26":{"白天":{"400":"重度降雪：无推荐的保持时间","800":"中度降雪：0:00-0:02","1200":"中度降雪：0:00-0:02","1600":"轻度降雪：0:02-0:07","2000":"轻度降雪：0:02-0:07","2400":"轻度降雪：0:02-0:07","2800":"极轻度降雪：0:07-0:10","3200":"极轻度降雪：0:07-0:10","4000":"极轻度降雪：0:07-0:10","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"},"夜间":{"400":"重度降雪：无推荐的保持时间","800":"重度降雪：无推荐的保持时间","1200":"中度降雪：0:00-0:02","1600":"中度降雪：0:00-0:02","2000":"中度降雪：0:00-0:02","2400":"中度降雪：0:00-0:02","2800":"轻度降雪：0:02-0:07","3200":"轻度降雪：0:02-0:07","4000":"极轻度降雪：0:07-0:10","无":"小雨夹雪：无推荐的保持时间/冻雾：0:20-0:40"}}};

$("#button1").bind('click', function () {
    var temperature1 = $("#temperature1").val();
    var times1 = $("#form1").find("input[name='time1']:checked").val();
    var visibility1 = $("#visibility1").val();
    var patrn = /^(-)?\d+(\.\d+)?$/;
    if(patrn.exec(temperature1)== null || temperature1 == ""){
        $("#form1 .fontSize").html("温度格式有误");return false;
    }
    if(temperature1< -30 || temperature1>15){
        $("#form1 .fontSize").html("温度不在检索范围");return false;
    }
    if(visibility1.length<=0){
        $("#form1 .fontSize").html("能见度未知");return false;
    }
    if(temperature1>=0){
        temperature1 = 15;
    }else if(temperature1>-4 && temperature1<0){
        temperature1 = '-1';
    }else if(temperature1>-7 && temperature1<=-4){
        temperature1 = '-4';
    }else if(temperature1>-11 && temperature1<=-7){
        temperature1 = '-7';
    }else{
        temperature1 = '-11';
    }
    $("#form1 .fontSize").html(DATAONE[temperature1][times1][visibility1]);
});
$("#button4").bind('click', function () {
    var temperature4 = $("#temperature4").val();
    var times4 = $("#form4").find("input[name='time4']:checked").val();
    var visibility4 = $("#visibility4").val();
    var patrn = /^(-)?\d+(\.\d+)?$/;
    if(patrn.exec(temperature4)== null || temperature4 == ""){
        $("#form4 .fontSize").html("温度格式有误");return false;
    }
    if(temperature4< -30 || temperature4>15){
        $("#form4 .fontSize").html("温度不在检索范围");return false;
    }
    if(visibility4.length<=0){
        $("#form4 .fontSize").html("能见度未知");return false;
    }
    if(temperature4>=0){
        temperature4 = 15;
    }else if(temperature4>-4 && temperature4<0){
        temperature4 = '-1';
    }else if(temperature4>-9 && temperature4<=-4){
        temperature4 = '-4';
    }else if(temperature4>-11 && temperature4<=-9){
        temperature4 = '-9';
    }else if(temperature4>-15 && temperature4<=-11){
        temperature4 = '-11';
    }else if(temperature4>-19 && temperature4<=-15){
        temperature4 = '-15';
    }else if(temperature4>-26 && temperature4<=-19){
        temperature4 = '-19';
    }else{
        temperature4 = '-26';
    }
    $("#form4 .fontSize").html(DATAFORE[temperature4][times4][visibility4]);

});
